#+TITLE: Documentation for LMML
#+AUTHOR: Fernando Rodriguez Flores

#+TODO: TODO BROKEN | DONE

***** Setting up an appropriate file system

      Once you have the files, you should copy them to a folder.  In my case, this folder will be /tmp/lmml/

      On that folder you should create a folder src.

      On the terminal you can do that with:

      #+begin_src sh
      mkdir src
      #+end_src

      We also need to create a folder called tests.

      #+begin_src sh
      mkdir tests
      #+end_src
     

      At this point, you should have the following structure on your folder

      #+begin_src sh
      ls /tmp/lmml
      #+end_src

      #+RESULTS:
      | gagm.lisp               |
      | lmml-case-sensitive.org |
      | lmml.org                |
      | src                     |
      | tests                   |

      Now, we only need one more step: move the file =gagm.lisp= to the folder =src=:

      #+begin_src sh
      mv gagm.lips src/
      #+end_src
     
      After that operation, we get a folder with the following structure:

      #+begin_src sh
      ls /tmp/lmml
      #+end_src

      #+RESULTS:
      | lmml-case-sensitive.org |
      | lmml.org                |
      | src                     |
      | tests                   |
     

      Once this is done, we can create the source files to start working with the models.

***** Load the system into the Lisp image

      1. Start Lisp

         To load the system, we need to start lisp.  In Emacs you can do this by typing =M-x slime=.

      2. Set the working directory

         After starting the Lisp, we need to set the working directory to the folder were we tangled the files.  In my case that folder is =/tmp/lmml/=.  In Emacs you can do that by typing =,= in the REPL, then =cd=, and then type the directory.

      3. Load the files

         Once the directory is set, we can load the system loading the file =src/load-files.lisp=:

         #+begin_src lisp :results output
         (load "src/load-lmml.lisp")
         #+end_src

         If everything worked fine, you should see in the REPL something like this:
     
         #+RESULTS:
         #+begin_example
         Loading src/gagm.lisp ........................... OK
         Loading src/package.lisp ........................ OK
         Loading src/generic-functions.lisp .............. OK
         Loading src/utilities.lisp ...................... OK
         Loading src/macros.lisp ......................... OK
         Loading src/reader-macros.lisp .................. OK
         Loading src/infix-to-prefix.lisp ................ OK
         Loading src/ast-nodes.lisp ...................... OK
         Loading src/basic-language.lisp ................. OK
         Loading src/code-generation-utils.lisp .......... OK
         Loading src/problem-examples.lisp ............... OK
         Loading src/writer-gmpl.lisp .................... OK
         Loading src/lmml-case-sensitivity.lisp .......... OK
         #+end_example

      4. Change to the package LMML

         The last step to set up the system is to change to the package LMML.  That can be done with:

         #+begin_src lisp :results value
         (in-package :LMML)
         #+end_src

         #+RESULTS:
         : #<PACKAGE "LMML">

         If that worked (and if you are working on Emacs with slime) the prompt in the REPL should have changed to =LMML>=.

      After these steps, we are ready to start writing our first model.  We'll do that on the next section.

****** export the problem to GMPL

       Once we have defined the problem, we can export it to any of the languages defined in LMML.  At the time of writing this tutorial the only defined language is GMPL, so we are going to export the problem to that language.

       Right now, we have stored the AST of the problem in the variable =tutorial1-problem=.

       Fortunately we can do that with only one line:

       #+begin_src lisp :results output  :tangle src/tutorial1.lisp
       (generate-code tutorial1-problem gmpl t)
       #+end_src

       #+RESULTS:
       #+begin_example
       /*Problem Example 1 for LMML tutorial*/


       var X, >= 0;

       var Y, >= 0;

       maximize obj: 4*X + 2*Y;

       s.t. r1: X + Y <= 3;

       end;
       #+end_example

       The function =generate-code= receives 3 arguments:

       - the ast of the model we want to export,
       - the language to which the model should be exported, and
       - the stream where we want to write the generated code.

       In this case the ast is the model we have defined in =tutorial1-problem=, the language is GMPL, and the stream is T.  In Lisp, that stream means to write the standard-output.

       Had we wanted to write the model to a file, we could have done the following:

       #+begin_src lisp :results none
       (with-open-file (f "/tmp/lmml/tutorial1.mod"
                          :direction :output
                          :if-exists :supersede)
  
         (generate-code tutorial1-problem gmpl f))
       #+end_src
      
       In that case the model was written to the file "/tmp/lmml/tutorial1.mod".  You should change that path to a correct one on your machine.

       To make sure it worked, we can call the program glpsol on our generated file like this:

       #+begin_src sh :results output
       glpsol -m /tmp/lmml/tutorial1.mod
       #+end_src

       #+RESULTS:
       #+begin_example
       GLPSOL: GLPK LP/MIP Solver, v4.57
       Parameter(s) specified in the command line:
        -m /tmp/lmml/tutorial1.mod
       Reading model section from /tmp/lmml/tutorial1.mod...
       12 lines were read
       Generating obj...
       Generating r1...
       Model has been successfully generated
       GLPK Simplex Optimizer, v4.57
       2 rows, 2 columns, 4 non-zeros
       Preprocessing...
       1 row, 2 columns, 2 non-zeros
       Scaling...
        A: min|aij| =  1.000e+00  max|aij| =  1.000e+00  ratio =  1.000e+00
       Problem data seem to be well scaled
       Constructing initial basis...
       Size of triangular part is 1
       ,*     0: obj =  -0.000000000e+00 inf =   0.000e+00 (2)
       ,*     1: obj =   1.200000000e+01 inf =   0.000e+00 (0)
       OPTIMAL LP SOLUTION FOUND
       Time used:   0.0 secs
       Memory used: 0.1 Mb (102260 bytes)
       #+end_example
      
       That output from glpsol means that the model was correctly created and solved.

****** conclusion

       Congratulations!  You have just finished your first tutorial on LMML.  In the next tutorial we'll cover some other topics.

       For instance, let's check our model and the code generated from it.

       This is our model in LMML:

       #+begin_src lisp :results none  :tangle src/tutorial1.lisp
       (problem tutorial1-problem
                "Example 1 for LMML tutorial"

                (variable-declaration x)
                (variable-declaration y)

                (maximize "obj" (+ (* 4 x) (* 2 y)))

                (constraint "r1" (<= (+ x y) 3))))
       #+end_src
      
       And this is the generated code:

       #+begin_src lisp :results output  :tangle src/tutorial1.lisp
       (generate-code tutorial1-problem gmpl t)
       #+end_src

       #+RESULTS:
       #+begin_example
       /*Problem Example 1 for LMML tutorial*/


       var X, >= 0;

       var Y, >= 0;

       maximize obj: 4*X + 2*Y;

       s.t. r1: X + Y <= 3;

       end;
       #+end_example

       There is a difference.  We defined the variables with lowercase letters x and y, but in the generated code we have them in uppercase.  That happens because Common Lisp usually behaves as if it were case insensitive, and so upcases all the symbols.  But we don't want that behavior.  We want our variables, parameters and sets defined and stored in the same case as we type them.

       In the next tutorial we'll deal with that issue ;-).

***** Setting up an appropriate file system

      Once you have the files, you should copy them to a folder.  In my case, this folder will be /tmp/lmml/

      On that folder you should create a folder src.

      On the terminal you can do that with:

      #+begin_src sh
      mkdir src
      #+end_src

      We also need to create a folder called tests.

      #+begin_src sh
      mkdir tests
      #+end_src
     

      At this point, you should have the following structure on your folder

      #+begin_src sh
      ls /tmp/lmml
      #+end_src

      #+RESULTS:
      | gagm.lisp               |
      | lmml-case-sensitive.org |
      | lmml.org                |
      | src                     |
      | tests                   |

      Now, we only need one more step: move the file =gagm.lisp= to the folder =src=:

      #+begin_src sh
      mv gagm.lips src/
      #+end_src
     
      After that operation, we get a folder with the following structure:

      #+begin_src sh
      ls /tmp/lmml
      #+end_src

      #+RESULTS:
      | lmml-case-sensitive.org |
      | lmml.org                |
      | src                     |
      | tests                   |
     

      Once this is done, we can create the source files to start working with the models.

***** Load the system into the Lisp image

      1. Start Lisp

         To load the system, we need to start lisp.  In Emacs you can do this by typing =M-x slime=.

      2. Set the working directory

         After starting the Lisp, we need to set the working directory to the folder were we tangled the files.  In my case that folder is =/tmp/lmml/=.  In Emacs you can do that by typing =,= in the REPL, then =cd=, and then type the directory.

      3. Load the files

         Once the directory is set, we can load the system loading the file =src/load-files.lisp=:

         #+begin_src lisp :results output
         (load "src/load-lmml.lisp")
         #+end_src

	 #+RESULTS:
	 #+begin_example
	 Loading src/gagm.lisp ........................... OK
	 Loading src/package.lisp ........................ OK
	 Loading src/generic-functions.lisp .............. OK
	 Loading src/utilities.lisp ...................... OK
	 Loading src/macros.lisp ......................... OK
	 Loading src/reader-macros.lisp .................. OK
	 Loading src/infix-to-prefix.lisp ................ OK
	 Loading src/ast-nodes.lisp ...................... OK
	 Loading src/basic-language.lisp ................. OK
	 Loading src/code-generation-utils.lisp .......... OK
	 Loading src/problem-examples.lisp ............... OK
	 Loading src/writer-gmpl.lisp .................... OK
	 Loading src/lmml-case-sensitivity.lisp .......... OK
	 #+end_example

	

         If everything worked fine, you should see in the REPL something like this:
     
         #+RESULTS:
         #+begin_example
         Loading src/gagm.lisp ........................... OK
         Loading src/package.lisp ........................ OK
         Loading src/generic-functions.lisp .............. OK
         Loading src/utilities.lisp ...................... OK
         Loading src/macros.lisp ......................... OK
         Loading src/reader-macros.lisp .................. OK
         Loading src/infix-to-prefix.lisp ................ OK
         Loading src/ast-nodes.lisp ...................... OK
         Loading src/basic-language.lisp ................. OK
         Loading src/code-generation-utils.lisp .......... OK
         Loading src/problem-examples.lisp ............... OK
         Loading src/writer-gmpl.lisp .................... OK
         Loading src/lmml-case-sensitivity.lisp .......... OK
         #+end_example

      4. Change to the package LMML

         The last step to set up the system is to change to the package LMML.  That can be done with:

         #+begin_src lisp :results value
         (in-package :LMML)
         #+end_src

         #+RESULTS:
	 : #<PACKAGE "LMML">

         If that worked (and if you are working on Emacs with slime) the prompt in the REPL should have changed to =LMML>=.

      After these steps, we are ready to start writing our first model.  We'll do that on the next section.

****** export the problem to GMPL (and solve it)

       Once we have defined the problem, we can export it to any of the languages defined in LMML.  At the time of writing this tutorial the only defined language is GMPL, so we are going to export the problem to that language.

       Right now, we have stored the AST of the problem in the variable =tutorial2-problem=.

       Fortunately we can do that with only one line:

       #+begin_src lisp :results output  :tangle src/tutorial1.lisp
       (generate-code tutorial2-problem gmpl t)
       #+end_src

       #+RESULTS:
       #+begin_example
       /*Problem Example 1 for LMML tutorial with case sensitivity*/


       var X, >= 0;

       var Y, >= 0;

       maximize obj: 4*X + 2*Y;

       s.t. r1: X + Y <= 3;

       end;
       #+end_example

       The arguments of the function =generate-code= can be found in the previous tutorial.

       Now we can see that the names of the variables in the generated code are lowercase, in the same way that we created them in Lisp.  This happened because of the function =(turn-on-case-sensitivity)=.


       Had we wanted to write the model to a file, we could have done the following:

       #+begin_src lisp :results none
       (WITH-OPEN-FILE (f "/tmp/lmml/tutorial2.mod"
                          :DIRECTION :OUTPUT
                          :IF-EXISTS :SUPERSEDE)

         (generate-code tutorial2-problem gmpl f))
       #+end_src

       Note that the instruction =WITH-OPEN-FILE= is written in uppercase letters as well as the keywords =:DIRECTION=, =:OUTPUT=, =:IF-EXISTS=, and =:SUPERSEDE=.  This is also because of the call to =(turn-on-case-sensitivity)=.  The reason is that there is not lowercase version that macro nor it's keywords.

       We didn't have to 'uppercase' the function or arguments in

       =(generate-code tutorial2-problem gmpl t)=

       because there are lowercase version of the function =GENERATE-CODE=, as well as the symbols =GMPL= and =T=.

       After the previous code is executed, the model is written to the file "/tmp/lmml/tutorial2.mod".  You should change that path to a correct one on your machine.

       To make sure it all worked as expected, we can call the program glpsol on our generated file like this:

       #+begin_src sh :results output
       glpsol -m /tmp/lmml/tutorial2.mod
       #+end_src

       #+RESULTS:
       #+begin_example
       GLPSOL: GLPK LP/MIP Solver, v4.57
       Parameter(s) specified in the command line:
        -m /tmp/lmml/tutorial2.mod
       Reading model section from /tmp/lmml/tutorial2.mod...
       12 lines were read
       Generating obj...
       Generating r1...
       Model has been successfully generated
       GLPK Simplex Optimizer, v4.57
       2 rows, 2 columns, 4 non-zeros
       Preprocessing...
       1 row, 2 columns, 2 non-zeros
       Scaling...
        A: min|aij| =  1.000e+00  max|aij| =  1.000e+00  ratio =  1.000e+00
       Problem data seem to be well scaled
       Constructing initial basis...
       Size of triangular part is 1
       *     0: obj =  -0.000000000e+00 inf =   0.000e+00 (2)
       *     1: obj =   1.200000000e+01 inf =   0.000e+00 (0)
       OPTIMAL LP SOLUTION FOUND
       Time used:   0.0 secs
       Memory used: 0.1 Mb (102260 bytes)
       #+end_example
      
       That output from glpsol means that the model was correctly created and solved.

***** Setting up an appropriate file system

      Once you have the files, you should copy them to a folder.  In my case, this folder will be /tmp/lmml/

      On that folder you should create a folder src.

      On the terminal you can do that with:

      #+begin_src sh
      mkdir src
      #+end_src

      We also need to create a folder called tests.

      #+begin_src sh
      mkdir tests
      #+end_src
     

      At this point, you should have the following structure on your folder

      #+begin_src sh
      ls /tmp/lmml
      #+end_src

      #+RESULTS:
      | gagm.lisp               |
      | lmml-case-sensitive.org |
      | lmml.org                |
      | src                     |
      | tests                   |

      Now, we only need one more step: move the file =gagm.lisp= to the folder =src=:

      #+begin_src sh
      mv gagm.lips src/
      #+end_src
     
      After that operation, we get a folder with the following structure:

      #+begin_src sh
      ls /tmp/lmml
      #+end_src

      #+RESULTS:
      | lmml-case-sensitive.org |
      | lmml.org                |
      | src                     |
      | tests                   |
     

      Once this is done, we can create the source files to start working with the models.
***** Load the system into the Lisp image

      1. Start Lisp

         To load the system, we need to start lisp.  In Emacs you can do this by typing =M-x slime=.

      2. Set the working directory

         After starting the Lisp, we need to set the working directory to the folder were we tangled the files.  In my case that folder is =/tmp/lmml/=.  In Emacs you can do that by typing =,= in the REPL, then =cd=, and then type the directory.

      3. Load the files

         Once the directory is set, we can load the system loading the file =src/load-files.lisp=:

         #+begin_src lisp :results output
         (load "src/load-lmml.lisp")
         #+end_src

         If everything worked fine, you should see in the REPL something like this:
     
         #+RESULTS:
         #+begin_example
         Loading src/gagm.lisp ........................... OK
         Loading src/package.lisp ........................ OK
         Loading src/generic-functions.lisp .............. OK
         Loading src/utilities.lisp ...................... OK
         Loading src/macros.lisp ......................... OK
         Loading src/reader-macros.lisp .................. OK
         Loading src/infix-to-prefix.lisp ................ OK
         Loading src/ast-nodes.lisp ...................... OK
         Loading src/basic-language.lisp ................. OK
         Loading src/code-generation-utils.lisp .......... OK
         Loading src/problem-examples.lisp ............... OK
         Loading src/writer-gmpl.lisp .................... OK
         Loading src/lmml-case-sensitivity.lisp .......... OK
         #+end_example

      4. Change to the package LMML

         The last step to set up the system is to change to the package LMML.  That can be done with:

         #+begin_src lisp :results value
         (in-package :LMML)
         #+end_src

         #+RESULTS:
         : #<PACKAGE "LMML">

         If that worked (and if you are working on Emacs with slime) the prompt in the REPL should have changed to =LMML>=.

      After these steps, we are ready to start writing our first model.  We'll do that on the next section.
****** declare the problem

       The next step is to create a problem.  A problem requires at least 3 parameters:

        - a symbol (where we'll store the problem),
        - a string (with a descriptive name for the problem), and
        - the instructions, that can be any number of instructions.

       First, let's create a problem with the id and the name.

       #+begin_src lisp :results none
       (problem tutorial3-problem
                "Example problem for the tutorial.  This one has parameters.")
       #+end_src
       
       In this case it is important to note that name of the problem is =tutorial3-problem= exactly with that case.

       #+begin_src lisp :results value
       tutorial3-problem
       #+end_src

       #+RESULTS:
       : problem: Example problem for the tutorial
       :    (INSTRUCTIONS-LIST (ELEMENTS NIL) )

       However, if we change the case of the symbol we get an error.  The change was to make the first T uppercase.

       #+begin_src lisp :results value
       Tutorial3-problem
       #+end_src
       
       #+begin_example
       The variable Tutorial3-problem is unbound.
       [Condition of type UNBOUND-VARIABLE]

       Restarts:
        0: [RETRY] Retry SLIME REPL evaluation request.
        1: [*ABORT] Return to SLIME's top level.
        2: [ABORT] abort thread (#<THREAD "repl-thread" RUNNING {10066836A3}>)
       
       Backtrace:
         0: (SB-INT:SIMPLE-EVAL-IN-LEXENV Tutorial3-problem #<NULL-LEXENV>)
         1: (EVAL Tutorial3-problem)
       #+end_example

       This is important from now on.  Everything should be typed with the appropriate case.  The first step is to add the parameters.

****** export the problem to GMPL (and solve it)

       Once we have defined the problem, we can export it to any of the languages defined in LMML.  At the time of writing this tutorial the only defined language is GMPL, so we are going to export the problem to that language.

       Right now, we have stored the AST of the problem in the variable =tutorial3-problem=.

       We can export it to any (defined) language with the following line:

       #+begin_src lisp :results output  :tangle src/tutorial1.lisp
       (generate-code tutorial3-problem gmpl t)
       #+end_src

       #+RESULTS:
       #+begin_example
       /*Problem Example 3 for LMML tutorial with parameters*/


       param c1 := 4;

       param c2 := 5;

       var x, >= 0;

       var y, >= 0;

       maximize obj: 4*x + 2*y;

       s.t. r1: x + y <= 3;

       end;
       #+end_example

       The function =generate-code= receives the AST we want to export, the language we want to export to, and a stream: in this case, the stream is t (the standard output).

       Had we wanted to write the model to a file, we could have done the following:

       #+begin_src lisp :results none
       (WITH-OPEN-FILE (f "/tmp/lmml/tutorial3.mod"
                          :DIRECTION :OUTPUT
                          :IF-EXISTS :SUPERSEDE)

         (generate-code tutorial3-problem gmpl f))
       #+end_src

       Note that the instruction =WITH-OPEN-FILE= is written in uppercase letters as well as the keywords =:DIRECTION=, =:OUTPUT=, =:IF-EXISTS=, and =:SUPERSEDE=.  This is also because of the call to =(turn-on-case-sensitivity)=.  The reason is that there is not lowercase version that macro nor it's keywords.

       We didn't have to 'uppercase' the function or arguments in

       =(generate-code tutorial3-problem gmpl t)=

       because there are lowercase version of the function =GENERATE-CODE=, as well as the symbols =GMPL= and =T=.

       After the previous code is executed, the model is written to the file "/tmp/lmml/tutorial3.mod".  You should change that path to a correct one on your machine.

       To make sure it all worked as expected, we can call the program glpsol on our generated file like this:

       #+begin_src sh :results output
       glpsol -m /tmp/lmml/tutorial3.mod
       #+end_src

       #+RESULTS:
       #+begin_example
       GLPSOL: GLPK LP/MIP Solver, v4.57
       Parameter(s) specified in the command line:
        -m /tmp/lmml/tutorial3.mod
       Reading model section from /tmp/lmml/tutorial3.mod...
       16 lines were read
       Generating obj...
       Generating r1...
       Model has been successfully generated
       GLPK Simplex Optimizer, v4.57
       2 rows, 2 columns, 4 non-zeros
       Preprocessing...
       1 row, 2 columns, 2 non-zeros
       Scaling...
        A: min|aij| =  1.000e+00  max|aij| =  1.000e+00  ratio =  1.000e+00
       Problem data seem to be well scaled
       Constructing initial basis...
       Size of triangular part is 1
       ,*     0: obj =  -0.000000000e+00 inf =   0.000e+00 (2)
       ,*     1: obj =   1.200000000e+01 inf =   0.000e+00 (0)
       OPTIMAL LP SOLUTION FOUND
       Time used:   0.0 secs
       Memory used: 0.1 Mb (102260 bytes)
       #+end_example
      
       That output from glpsol means that the model was correctly created and solved.

***** Setting up an appropriate file system

      Once you have the files, you should copy them to a folder.  In my case, this folder will be /tmp/lmml/

      On that folder you should create a folder src.

      On the terminal you can do that with:

      #+begin_src sh
      mkdir src
      #+end_src

      We also need to create a folder called tests.

      #+begin_src sh
      mkdir tests
      #+end_src
     

      At this point, you should have the following structure on your folder

      #+begin_src sh
      ls /tmp/lmml
      #+end_src

      #+RESULTS:
      | gagm.lisp               |
      | lmml-case-sensitive.org |
      | lmml.org                |
      | src                     |
      | tests                   |

      Now, we only need one more step: move the file =gagm.lisp= to the folder =src=:

      #+begin_src sh
      mv gagm.lips src/
      #+end_src
     
      After that operation, we get a folder with the following structure:

      #+begin_src sh
      ls /tmp/lmml
      #+end_src

      #+RESULTS:
      | lmml-case-sensitive.org |
      | lmml.org                |
      | src                     |
      | tests                   |
     

      Once this is done, we can create the source files to start working with the models.
***** Load the system into the Lisp image

      1. Start Lisp

         To load the system, we need to start lisp.  In Emacs you can do this by typing =M-x slime=.

      2. Set the working directory

         After starting the Lisp, we need to set the working directory to the folder were we tangled the files.  In my case that folder is =/tmp/lmml/=.  In Emacs you can do that by typing =,= in the REPL, then =cd=, and then type the directory.

      3. Load the files

         Once the directory is set, we can load the system loading the file =src/load-files.lisp=:

         #+begin_src lisp :results output
         (load "src/load-lmml.lisp")
         #+end_src

         If everything worked fine, you should see in the REPL something like this:
     
         #+RESULTS:
         #+begin_example
         Loading src/gagm.lisp ........................... OK
         Loading src/package.lisp ........................ OK
         Loading src/generic-functions.lisp .............. OK
         Loading src/utilities.lisp ...................... OK
         Loading src/macros.lisp ......................... OK
         Loading src/reader-macros.lisp .................. OK
         Loading src/infix-to-prefix.lisp ................ OK
         Loading src/ast-nodes.lisp ...................... OK
         Loading src/basic-language.lisp ................. OK
         Loading src/code-generation-utils.lisp .......... OK
         Loading src/problem-examples.lisp ............... OK
         Loading src/writer-gmpl.lisp .................... OK
         Loading src/lmml-case-sensitivity.lisp .......... OK
         #+end_example

      4. Change to the package LMML

         The last step to set up the system is to change to the package LMML.  That can be done with:

         #+begin_src lisp :results value
         (in-package :LMML)
         #+end_src

         #+RESULTS:
         : #<PACKAGE "LMML">

         If that worked (and if you are working on Emacs with slime) the prompt in the REPL should have changed to =LMML>=.

      After these steps, we are ready to start writing our first model.  We'll do that on the next section.
****** export the problem to GMPL (and solve it)

       Once we have defined the problem, we can export it to any of the languages defined in LMML.  At the time of writing this tutorial the only defined language is GMPL, so we are going to export the problem to that language.

       Right now, we have stored the AST of the problem in the variable =tutorial4-problem=.

       We can export it to any (defined) language with the following line:

       #+begin_src lisp :results output  :tangle src/tutorial1.lisp
       (generate-code tutorial4-problem gmpl t)
       #+end_src

       #+RESULTS:
       #+begin_example
       /*Problem Example 4 for LMML tutorial with sets and index-at*/


       set I := {1,2};

       var x {i in I}, >= 0;

       maximize obj: 3*x[1] + 4*x[2];

       s.t. r1: x[1] + x[2] <= 3;

       end;
       #+end_example

       The function =generate-code= receives the AST we want to export, the language we want to export to, and a stream: in this case, the stream is t (the standard output).

       Had we wanted to write the model to a file, we could have done the following:

       #+begin_src lisp :results none
       (WITH-OPEN-FILE (f "/tmp/lmml/tutorial4.mod"
                          :DIRECTION :OUTPUT
                          :IF-EXISTS :SUPERSEDE)

         (generate-code tutorial4-problem gmpl f))
       #+end_src

       Note that the instruction =WITH-OPEN-FILE= is written in uppercase letters as well as the keywords =:DIRECTION=, =:OUTPUT=, =:IF-EXISTS=, and =:SUPERSEDE=.  This is also because of the call to =(turn-on-case-sensitivity)=.  The reason is that there is not lowercase version that macro nor it's keywords.

       We didn't have to 'uppercase' the function or arguments in

       =(generate-code tutorial4-problem gmpl t)=

       because there are lowercase version of the function =GENERATE-CODE=, as well as the symbols =GMPL= and =T=.

       After the previous code is executed, the model is written to the file "/tmp/lmml/tutorial4.mod".  You should change that path to a correct one on your machine.

       To make sure it all worked as expected, we can call the program glpsol on our generated file like this:

       #+begin_src sh :results output
       glpsol -m /tmp/lmml/tutorial4.mod
       #+end_src

       #+RESULTS:
       #+begin_example
       GLPSOL: GLPK LP/MIP Solver, v4.57
       Parameter(s) specified in the command line:
        -m /tmp/lmml/tutorial4.mod
       Reading model section from /tmp/lmml/tutorial4.mod...
       12 lines were read
       Generating obj...
       Generating r1...
       Model has been successfully generated
       GLPK Simplex Optimizer, v4.57
       2 rows, 2 columns, 4 non-zeros
       Preprocessing...
       1 row, 2 columns, 2 non-zeros
       Scaling...
        A: min|aij| =  1.000e+00  max|aij| =  1.000e+00  ratio =  1.000e+00
       Problem data seem to be well scaled
       Constructing initial basis...
       Size of triangular part is 1
       ,*     0: obj =  -0.000000000e+00 inf =   0.000e+00 (2)
       ,*     1: obj =   1.200000000e+01 inf =   0.000e+00 (0)
       OPTIMAL LP SOLUTION FOUND
       Time used:   0.0 secs
       Memory used: 0.1 Mb (118324 bytes)
       #+end_example

       That output from glpsol means that the model was correctly created and solved.

***** Setting up an appropriate file system

      Once you have the files, you should copy them to a folder.  In my case, this folder will be /tmp/lmml/

      On that folder you should create a folder src.

      On the terminal you can do that with:

      #+begin_src sh
      mkdir src
      #+end_src

      We also need to create a folder called tests.

      #+begin_src sh
      mkdir tests
      #+end_src
     

      At this point, you should have the following structure on your folder

      #+begin_src sh
      ls /tmp/lmml
      #+end_src

      #+RESULTS:
      | gagm.lisp               |
      | lmml-case-sensitive.org |
      | lmml.org                |
      | src                     |
      | tests                   |

      Now, we only need one more step: move the file =gagm.lisp= to the folder =src=:

      #+begin_src sh
      mv gagm.lips src/
      #+end_src
     
      After that operation, we get a folder with the following structure:

      #+begin_src sh
      ls /tmp/lmml
      #+end_src

      #+RESULTS:
      | lmml-case-sensitive.org |
      | lmml.org                |
      | src                     |
      | tests                   |
     

      Once this is done, we can create the source files to start working with the models.
***** Load the system into the Lisp image

      1. Start Lisp

         To load the system, we need to start lisp.  In Emacs you can do this by typing =M-x slime=.

      2. Set the working directory

         After starting the Lisp, we need to set the working directory to the folder were we tangled the files.  In my case that folder is =/tmp/lmml/=.  In Emacs you can do that by typing =,= in the REPL, then =cd=, and then type the directory.

      3. Load the files

         Once the directory is set, we can load the system loading the file =src/load-files.lisp=:

         #+begin_src lisp :results output
         (load "src/load-lmml.lisp")
         #+end_src

         If everything worked fine, you should see in the REPL something like this:
     
         #+RESULTS:
         #+begin_example
         Loading src/gagm.lisp ........................... OK
         Loading src/package.lisp ........................ OK
         Loading src/generic-functions.lisp .............. OK
         Loading src/utilities.lisp ...................... OK
         Loading src/macros.lisp ......................... OK
         Loading src/reader-macros.lisp .................. OK
         Loading src/infix-to-prefix.lisp ................ OK
         Loading src/ast-nodes.lisp ...................... OK
         Loading src/basic-language.lisp ................. OK
         Loading src/code-generation-utils.lisp .......... OK
         Loading src/problem-examples.lisp ............... OK
         Loading src/writer-gmpl.lisp .................... OK
         Loading src/lmml-case-sensitivity.lisp .......... OK
         #+end_example

      4. Change to the package LMML

         The last step to set up the system is to change to the package LMML.  That can be done with:

         #+begin_src lisp :results value
         (in-package :LMML)
         #+end_src

         #+RESULTS:
         : #<PACKAGE "LMML">

         If that worked (and if you are working on Emacs with slime) the prompt in the REPL should have changed to =LMML>=.

      After these steps, we are ready to start writing our first model.  We'll do that on the next section.
****** export the problem to GMPL

       Once we have defined the problem, we can export it to any of the languages defined in LMML.  At the time of writing this tutorial the only defined language is GMPL, so we are going to export the problem to that language.

       Right now, we have stored the AST of the problem in the variable =tutorial5-problem=.

       We can export it to any (defined) language with the following line:

       #+begin_src lisp :results output  :tangle src/tutorial1.lisp
       (generate-code tutorial5-problem gmpl t)
       #+end_src

       #+RESULTS:
       #+begin_example
       /*Problem Example 5 for LMML tutorial with sums and indexed parameters.*/
       
       
       set I;
       
       param c {i in I};
       
       var x {i in I}, >= 0;
       
       maximize obj: sum {i in I} c[i]*x[i];
       
       s.t. r1: sum {i in I} x[i] <= 3;
       
       end;
       #+end_example

       The function =generate-code= receives the AST we want to export, the language we want to export to, and a stream: in this case, the stream is t (the standard output).

       Had we wanted to write the model to a file, we could have done the following:

       #+begin_src lisp :results none
       (WITH-OPEN-FILE (f "/tmp/lmml/tutorial5.mod"
                          :DIRECTION :OUTPUT
                          :IF-EXISTS :SUPERSEDE)

         (generate-code tutorial5-problem gmpl f))
       #+end_src

       Note that the instruction =WITH-OPEN-FILE= is written in uppercase letters as well as the keywords =:DIRECTION=, =:OUTPUT=, =:IF-EXISTS=, and =:SUPERSEDE=.  This is also because of the call to =(turn-on-case-sensitivity)=.  The reason is that there is not lowercase version that macro nor it's keywords.

       We didn't have to 'uppercase' the function or arguments in

       =(generate-code tutorial5-problem gmpl t)=

       because there are lowercase version of the function =GENERATE-CODE=, as well as the symbols =GMPL= and =T=.

       After the previous code is executed, the model is written to the file "/tmp/lmml/tutorial5.mod".  You should change that path to a correct one on your machine.

       In this case, we can't solve the problem (yet) because we haven't defined the value of the parameters.  That can be done with a =data-section=, of which we are going to talk in the last tutorial.  If you want, you can take a look at that tutorial and solve this model ;-).

***** Setting up an appropriate file system

      Once you have the files, you should copy them to a folder.  In my case, this folder will be /tmp/lmml/

      On that folder you should create a folder src.

      On the terminal you can do that with:

      #+begin_src sh
      mkdir src
      #+end_src

      We also need to create a folder called tests.

      #+begin_src sh
      mkdir tests
      #+end_src
     

      At this point, you should have the following structure on your folder

      #+begin_src sh
      ls /tmp/lmml
      #+end_src

      #+RESULTS:
      | gagm.lisp               |
      | lmml-case-sensitive.org |
      | lmml.org                |
      | src                     |
      | tests                   |

      Now, we only need one more step: move the file =gagm.lisp= to the folder =src=:

      #+begin_src sh
      mv gagm.lips src/
      #+end_src
     
      After that operation, we get a folder with the following structure:

      #+begin_src sh
      ls /tmp/lmml
      #+end_src

      #+RESULTS:
      | lmml-case-sensitive.org |
      | lmml.org                |
      | src                     |
      | tests                   |
     

      Once this is done, we can create the source files to start working with the models.
***** Load the system into the Lisp image

      1. Start Lisp

         To load the system, we need to start lisp.  In Emacs you can do this by typing =M-x slime=.

      2. Set the working directory

         After starting the Lisp, we need to set the working directory to the folder were we tangled the files.  In my case that folder is =/tmp/lmml/=.  In Emacs you can do that by typing =,= in the REPL, then =cd=, and then type the directory.

      3. Load the files

         Once the directory is set, we can load the system loading the file =src/load-files.lisp=:

         #+begin_src lisp :results output
         (load "src/load-lmml.lisp")
         #+end_src

         If everything worked fine, you should see in the REPL something like this:
     
         #+RESULTS:
         #+begin_example
         Loading src/gagm.lisp ........................... OK
         Loading src/package.lisp ........................ OK
         Loading src/generic-functions.lisp .............. OK
         Loading src/utilities.lisp ...................... OK
         Loading src/macros.lisp ......................... OK
         Loading src/reader-macros.lisp .................. OK
         Loading src/infix-to-prefix.lisp ................ OK
         Loading src/ast-nodes.lisp ...................... OK
         Loading src/basic-language.lisp ................. OK
         Loading src/code-generation-utils.lisp .......... OK
         Loading src/problem-examples.lisp ............... OK
         Loading src/writer-gmpl.lisp .................... OK
         Loading src/lmml-case-sensitivity.lisp .......... OK
         #+end_example

      4. Change to the package LMML

         The last step to set up the system is to change to the package LMML.  That can be done with:

         #+begin_src lisp :results value
         (in-package :LMML)
         #+end_src

         #+RESULTS:
         : #<PACKAGE "LMML">

         If that worked (and if you are working on Emacs with slime) the prompt in the REPL should have changed to =LMML>=.

      After these steps, we are ready to start writing our first model.  We'll do that on the next section.
****** export the problem to GMPL 

       Once we have defined the problem, we can export it to any of the languages defined in LMML.  At the time of writing this tutorial the only defined language is GMPL, so we are going to export the problem to that language.

       Right now, we have stored the AST of the problem in the variable =tutorial6-problem=.

       We can export it to any (defined) language with the following line:

       #+begin_src lisp :results output  :tangle src/tutorial1.lisp
       (generate-code tutorial6-problem gmpl t)
       #+end_src

       #+RESULTS:
       #+begin_example
       /*Problem Example 6 for LMML tutorial with for all quantifiers*/
       
       
       set I;
       
       var x {i in I, j in I}, binary, >= 0;
       
       param c {i in I, j in I};
       
       minimize obj: sum {i in I, j in I} c[i]*x[i];
       
       s.t. r1 {j in I}: sum {i in I} x[i, j] = 1;
       
       s.t. r2 {i in I}: sum {j in I} x[i, j] = 1;
       
       end;
       #+end_example

       The function =generate-code= receives the AST we want to export, the language we want to export to, and a stream: in this case, the stream is t (the standard output).

       Had we wanted to write the model to a file, we could have done the following:

       #+begin_src lisp :results none
       (WITH-OPEN-FILE (f "/tmp/lmml/tutorial5.mod"
                          :DIRECTION :OUTPUT
                          :IF-EXISTS :SUPERSEDE)

         (generate-code tutorial6-problem gmpl f))
       #+end_src

       Note that the instruction =WITH-OPEN-FILE= is written in uppercase letters as well as the keywords =:DIRECTION=, =:OUTPUT=, =:IF-EXISTS=, and =:SUPERSEDE=.  This is also because of the call to =(turn-on-case-sensitivity)=.  The reason is that there is not lowercase version that macro nor it's keywords.

       We didn't have to 'uppercase' the function or arguments in

       =(generate-code tutorial5-problem gmpl t)=

       because there are lowercase version of the function =GENERATE-CODE=, as well as the symbols =GMPL= and =T=.

       After the previous code is executed, the model is written to the file "/tmp/lmml/tutorial6.mod".  You should change that path to a correct one on your machine.

***** Setting up an appropriate file system

      Once you have the files, you should copy them to a folder.  In my case, this folder will be /tmp/lmml/

      On that folder you should create a folder src.

      On the terminal you can do that with:

      #+begin_src sh
      mkdir src
      #+end_src

      We also need to create a folder called tests.

      #+begin_src sh
      mkdir tests
      #+end_src
     

      At this point, you should have the following structure on your folder

      #+begin_src sh
      ls /tmp/lmml
      #+end_src

      #+RESULTS:
      | gagm.lisp               |
      | lmml-case-sensitive.org |
      | lmml.org                |
      | src                     |
      | tests                   |

      Now, we only need one more step: move the file =gagm.lisp= to the folder =src=:

      #+begin_src sh
      mv gagm.lips src/
      #+end_src
     
      After that operation, we get a folder with the following structure:

      #+begin_src sh
      ls /tmp/lmml
      #+end_src

      #+RESULTS:
      | lmml-case-sensitive.org |
      | lmml.org                |
      | src                     |
      | tests                   |
     

      Once this is done, we can create the source files to start working with the models.
***** Load the system into the Lisp image

      1. Start Lisp

         To load the system, we need to start lisp.  In Emacs you can do this by typing =M-x slime=.

      2. Set the working directory

         After starting the Lisp, we need to set the working directory to the folder were we tangled the files.  In my case that folder is =/tmp/lmml/=.  In Emacs you can do that by typing =,= in the REPL, then =cd=, and then type the directory.

      3. Load the files

         Once the directory is set, we can load the system loading the file =src/load-files.lisp=:

         #+begin_src lisp :results output
         (load "src/load-lmml.lisp")
         #+end_src

         If everything worked fine, you should see in the REPL something like this:
     
         #+RESULTS:
         #+begin_example
         Loading src/gagm.lisp ........................... OK
         Loading src/package.lisp ........................ OK
         Loading src/generic-functions.lisp .............. OK
         Loading src/utilities.lisp ...................... OK
         Loading src/macros.lisp ......................... OK
         Loading src/reader-macros.lisp .................. OK
         Loading src/infix-to-prefix.lisp ................ OK
         Loading src/ast-nodes.lisp ...................... OK
         Loading src/basic-language.lisp ................. OK
         Loading src/code-generation-utils.lisp .......... OK
         Loading src/problem-examples.lisp ............... OK
         Loading src/writer-gmpl.lisp .................... OK
         Loading src/lmml-case-sensitivity.lisp .......... OK
         #+end_example

      4. Change to the package LMML

         The last step to set up the system is to change to the package LMML.  That can be done with:

         #+begin_src lisp :results value
         (in-package :LMML)
         #+end_src

         #+RESULTS:
         : #<PACKAGE "LMML">

         If that worked (and if you are working on Emacs with slime) the prompt in the REPL should have changed to =LMML>=.

      After these steps, we are ready to start writing our first model.  We'll do that on the next section.
****** export the problem to GMPL 

       Once we have defined the problem, we can export it to any of the languages defined in LMML.  At the time of writing this tutorial the only defined language is GMPL, so we are going to export the problem to that language.

       Right now, we have stored the AST of the problem in the variable =tutorial7-problem=.

       We can export it to any (defined) language with the following line:

       #+begin_src lisp :results output  :tangle src/tutorial1.lisp
       (generate-code tutorial7-problem gmpl t)
       #+end_src

       #+RESULTS:
       #+begin_example
       /*Problem Example 7 for LMML tutorial with for data section*/


       set I;

       set J;

       var x {i in I, j in J}, binary, >= 0;

       param d;

       param b {i in I};

       param c {i in I, j in J};

       minimize obj: sum {i in I, j in I} c[i]*x[i];

       s.t. r1 {j in I}: sum {i in I} b[i]*x[i, j] <= 1;

       end;
       #+end_example

       The function =generate-code= receives the AST we want to export, the language we want to export to, and a stream: in this case, the stream is t (the standard output).

       Had we wanted to write the model to a file, we could have done the following:

       #+begin_src lisp :results none
       (WITH-OPEN-FILE (f "/tmp/lmml/tutorial5.mod"
                          :DIRECTION :OUTPUT
                          :IF-EXISTS :SUPERSEDE)

         (generate-code tutorial7-problem gmpl f))
       #+end_src

       Note that the instruction =WITH-OPEN-FILE= is written in uppercase letters as well as the keywords =:DIRECTION=, =:OUTPUT=, =:IF-EXISTS=, and =:SUPERSEDE=.  This is also because of the call to =(turn-on-case-sensitivity)=.  The reason is that there is not lowercase version that macro nor it's keywords.

       We didn't have to 'uppercase' the function or arguments in

       =(generate-code tutorial5-problem gmpl t)=

       because there are lowercase version of the function =GENERATE-CODE=, as well as the symbols =GMPL= and =T=.

       After the previous code is executed, the model is written to the file "/tmp/lmml/tutorial7.mod".  You should change that path to a correct one on your machine.

       Now, if we want to solve that problem, we need to provide some data for the parameters.  In LMML that can be done with the section data, and we can deal with that in the following section.

****** export the new model and solve it

              Once we have defined the problem, we can export it to any of the languages defined in LMML.  At the time of writing this tutorial the only defined language is GMPL, so we are going to export the problem to that language.

       Right now, we have stored the AST of the problem in the variable =tutorial7-problem-and-data=.

       We can export it to any (defined) language with the following line:

       #+begin_src lisp :results output  :tangle src/tutorial1.lisp
       (generate-code |tutorial7-problem-and-data| gmpl t)
       #+end_src

       #+RESULTS:
       #+begin_example
       /*Problem Example 7 for LMML tutorial with for data section*/


       set I;

       set J;

       var x {i in I, j in J}, binary, >= 0;

       param d;

       param b {i in I};

       param c {i in I, j in J};

       minimize obj: sum {i in I, j in I} c[i, j]*x[i, j];

       s.t. r1 {j in J}: sum {i in I} b[i]*x[i, j] <= 1;

       data;

       set I := 1, 2;

       set J := 1, 2, 3;

       param d := 5;

       param b := 1 3
                  2 4;

       param c :    1 2 3 :=
                 1  1 2 3
                 2  3 2 1;

       end;
       #+end_example

       Had we wanted to write the model to a file, we could have done the following:

       #+begin_src lisp :results none
       (WITH-OPEN-FILE (f "/tmp/lmml/tutorial7.mod"
                          :DIRECTION :OUTPUT
                          :IF-EXISTS :SUPERSEDE)

         (generate-code tutorial7-problem-and-data gmpl f))
       #+end_src

       Note that the instruction =WITH-OPEN-FILE= is written in uppercase letters as well as the keywords =:DIRECTION=, =:OUTPUT=, =:IF-EXISTS=, and =:SUPERSEDE=.  This is also because of the call to =(turn-on-case-sensitivity)=.  The reason is that there is not lowercase version that macro nor it's keywords.

       We didn't have to 'uppercase' the function or arguments in

       =(generate-code tutorial7-problem-and-data gmpl t)=

       because there are lowercase version of the function =GENERATE-CODE=, as well as the symbols =GMPL= and =T=.

       After the previous code is executed, the model is written to the file "/tmp/lmml/tutorial7.mod".  You should change that path to a correct one on your machine.

       To solve it we just call =glpsol= as:

       #+begin_src sh :results output
       glpsol -m /tmp/lmml/tutorial7.mod
       #+end_src

       #+RESULTS:
       #+begin_example
       GLPSOL: GLPK LP/MIP Solver, v4.57
       Parameter(s) specified in the command line:
        -m /tmp/lmml/tutorial7.mod
       Reading model section from /tmp/lmml/tutorial7.mod...
       Reading data section from /tmp/lmml/tutorial7.mod...
       35 lines were read
       Generating obj...
       Generating r1...
       Model has been successfully generated
       GLPK Integer Optimizer, v4.57
       4 rows, 6 columns, 10 non-zeros
       6 integer variables, all of which are binary
       Preprocessing...
       3 rows, 0 columns, 0 non-zeros
       0 integer variables, none of which are binary
       Scaling...
        A: min|aij| =  1.000e+00  max|aij| =  1.000e+00  ratio =  1.000e+00
       Problem data seem to be well scaled
       Solving LP relaxation...
       GLPK Simplex Optimizer, v4.57
       3 rows, 0 columns, 0 non-zeros
       ~     0: obj =   0.000000000e+00  infeas =  0.000e+00
       OPTIMAL SOLUTION FOUND
       Integer optimization begins...
       +     0: mip =     not found yet >=              -inf        (1; 0)
       +     0: >>>>>   0.000000000e+00 >=   0.000000000e+00   0.0% (1; 0)
       +     0: mip =   0.000000000e+00 >=     tree is empty   0.0% (0; 1)
       INTEGER OPTIMAL SOLUTION FOUND
       Time used:   0.0 secs
       Memory used: 0.1 Mb (120665 bytes)
       #+end_example

       That output from =glpsol= means that everything went fine.
       
***** create a constructor for the class

A constructor is a function that receives some arguments and returns an instance of the class with its slots properly initialized to those arguments.

In this case, we want that constructor to have an explicit name.  In an ideal world it should be =subset=, that describes precisely the opreation; but that's not the name we are going to use, because this should not be the final version of the code ;-).  Because of that, the name we are going to use is =subset%%=.

This function should receive as arguments the left-hand and right-hand side of the operation.  A first approach could be this:

#+begin_src lisp :results none
(defun subset%% (left right)
  (make-instance 'subset-op%% :left left :right right))
#+end_src

The next step should be to test the function.

#+begin_src lisp :results output
(let* ((ast (subset%% "X" "C")))
  (format t "~a" ast))
#+end_src

#+RESULTS:
: (BINARY-OPERATION (LEFT X) (RIGHT C) )

So far it works.  The only problem is that the generic function =print-object= is executing the code of the base class =binary-operation=, because there is no method defined for this class.  

That's precisely the third step in the tutorial, and the optional one.  It is not mandatory, but it makes life a lot easier ;-).

***** write the print-object method

A =print-object= method for this class should be simple:

#+begin_src lisp :results none
(defmethod print-object ((obj subset-op%%) stream)
  (format stream "(subset ~a ~a)" (left obj) (right obj)))
#+end_src

Let's test it with the same code that we used before:

#+begin_src lisp :results output
(let* ((ast (subset%% "X" "C")))
  (format t "~a" ast))
#+end_src

#+RESULTS:
: (subset X C)

It works \o/.

An after we add these code snippets, we can have a binary operation =subset= :-D.  Those are the steps that should be taken whenever we want to add new operations to lmml.

But as we said before, if the operation we want to add to lmml is a binary-operation, all of this can be done very quickly with only one line of code.  That's what we'll do in the next tutorial.

***** creating the subset operation with the macro
So, with this description, if we want to create the class subeset using this macro we just need to add the following line:

#+begin_src lisp :results none
(make-binary-operations
 ((subset "subset" "subset")))
#+end_src

After a couple of macroexpansions we get the following code:

#+begin_src lisp
(PROGN
 (PROGN
  (PROGN
   (DEFCLASS SUBSET-OP (BINARY-OPERATION) NIL
             (:DOCUMENTATION "Class representing the subset operation"))
   (DEFUN SUBSET-OP (LEFT RIGHT)
     (SYMBOL-MACROLET ((MAKE-CTR
                        (MAKE-INSTANCE 'SUBSET-OP :LEFT LEFT :RIGHT RIGHT)))
       MAKE-CTR))
   (DEFMETHOD PRINT-OBJECT ((NODE SUBSET-OP) STREAM)
     (FORMAT STREAM "(subset ~a ~a)" (LEFT NODE) (RIGHT NODE))))))
#+end_src

The only problem we have now with the generated code is that the name of the constructor is =subset-op= :-|.  (Don't tell this to anyone, but that could be fixed in the code for the macro :-|.  This should be fixed in a near future :-|)

But that's simple enough, we only need to write the code for the constructor:

#+begin_src lisp :results none
(defun subset (left right)
  (make-instance 'subset-op :left left :right right))
#+end_src

And after we evaluate that code snippte, we can check the results:

#+begin_src lisp :results output
(let* ((ast (subset "X" "C")))
  (format t "~a" ast))
#+end_src

#+RESULTS:
: (subset X C)
 
And that's all we need: a call to =make-binary-operations= and then write the constructor.   

Actually, there's no need to do that :smirk:.  There is macro called =make-binary-operations-layer-2-names= that allow us to define how we would like to name the constructors of the binary-operations.



In the next tutorial I'm going to add 3 binary-operations: subset, not-equal-to and belongs (or set membership).
***** the tests
An now, let's test it:
#+begin_src lisp :results output
(let* ((ast1 (subset "Y" "C"))
       (ast2 (!= "a" "1"))
       (ast3 (in "b" "I")))
  (bformat t "testing subset, not equal and belongs")
  (format t "~a~%" ast1)
  (format t "~a~%" ast2)
  (format t "~a~%" ast3))
#+end_src

#+RESULTS:
: =======================================
:  testing subset, not equal and belongs
: =======================================
: 
: (subset Y C)
: (not-equal a 1)
: (belongs-to b I)

And that should do it :-D.

